{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "_minus_scalar", 
      "name": "_minusscalar0", 
      "attrs": {"scalar": "127.5"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar0", 
      "attrs": {"scalar": "0.0078125"}, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_1_conv2d_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_1_conv2d", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_1_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_1_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_1_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_1_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_1_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 1], [8, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_2_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_2_conv2d", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_2_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_2_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_2_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_2_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_2_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 1], [16, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_2_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3_dw_conv2d_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "32", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_3_dw_conv2d", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "32", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3_dw_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3_dw_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3_dw_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3_dw_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_3_dw_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0], [23, 0, 1], [24, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_3_dw_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_3_conv2d", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_3_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0], [31, 0, 1], [32, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_4_dw_conv2d_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_4_dw_conv2d", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_4_dw_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_4_dw_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_4_dw_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_4_dw_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_4_dw_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0], [39, 0, 1], [40, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_4_dw_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_4_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_4_conv2d", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[42, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_4_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_4_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_4_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_4_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_4_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[44, 0, 0], [45, 0, 0], [46, 0, 0], [47, 0, 1], [48, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_4_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_5_dw_conv2d_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "32", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_5_dw_conv2d", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "32", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_5_dw_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_5_dw_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_5_dw_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_5_dw_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_5_dw_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[52, 0, 0], [53, 0, 0], [54, 0, 0], [55, 0, 1], [56, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_5_dw_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_5_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_5_conv2d", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_5_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_5_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_5_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_5_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_5_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[60, 0, 0], [61, 0, 0], [62, 0, 0], [63, 0, 1], [64, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_5_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_6_dw_conv2d_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_6_dw_conv2d", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[66, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_6_dw_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_6_dw_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_6_dw_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_6_dw_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_6_dw_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[68, 0, 0], [69, 0, 0], [70, 0, 0], [71, 0, 1], [72, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_6_dw_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_6_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_6_conv2d", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[74, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_6_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_6_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_6_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_6_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_6_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[76, 0, 0], [77, 0, 0], [78, 0, 0], [79, 0, 1], [80, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_6_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_7_dw_conv2d_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_7_dw_conv2d", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_7_dw_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_7_dw_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_7_dw_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_7_dw_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_7_dw_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[84, 0, 0], [85, 0, 0], [86, 0, 0], [87, 0, 1], [88, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_7_dw_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[89, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_7_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_7_conv2d", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[90, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_7_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_7_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_7_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_7_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_7_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[92, 0, 0], [93, 0, 0], [94, 0, 0], [95, 0, 1], [96, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_7_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[97, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_8_dw_conv2d_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_8_dw_conv2d", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[98, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_8_dw_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_8_dw_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_8_dw_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_8_dw_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_8_dw_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[100, 0, 0], [101, 0, 0], [102, 0, 0], [103, 0, 1], [104, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_8_dw_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[105, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_8_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_8_conv2d", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[106, 0, 0], [107, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_8_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_8_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_8_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_8_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_8_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[108, 0, 0], [109, 0, 0], [110, 0, 0], [111, 0, 1], [112, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_8_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_9_dw_conv2d_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_9_dw_conv2d", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[114, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_9_dw_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_9_dw_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_9_dw_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_9_dw_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_9_dw_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[116, 0, 0], [117, 0, 0], [118, 0, 0], [119, 0, 1], [120, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_9_dw_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_9_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_9_conv2d", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[122, 0, 0], [123, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_9_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_9_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_9_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_9_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_9_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[124, 0, 0], [125, 0, 0], [126, 0, 0], [127, 0, 1], [128, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_9_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[129, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_10_dw_conv2d_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_10_dw_conv2d", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[130, 0, 0], [131, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_10_dw_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_10_dw_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_10_dw_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_10_dw_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_10_dw_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[132, 0, 0], [133, 0, 0], [134, 0, 0], [135, 0, 1], [136, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_10_dw_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[137, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_10_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_10_conv2d", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[138, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_10_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_10_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_10_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_10_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_10_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[140, 0, 0], [141, 0, 0], [142, 0, 0], [143, 0, 1], [144, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_10_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[145, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_11_dw_conv2d_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_11_dw_conv2d", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[146, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_11_dw_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_11_dw_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_11_dw_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_11_dw_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_11_dw_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[148, 0, 0], [149, 0, 0], [150, 0, 0], [151, 0, 1], [152, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_11_dw_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_11_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_11_conv2d", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[154, 0, 0], [155, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_11_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_11_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_11_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_11_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_11_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[156, 0, 0], [157, 0, 0], [158, 0, 0], [159, 0, 1], [160, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_11_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[161, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_12_dw_conv2d_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_12_dw_conv2d", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[162, 0, 0], [163, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_12_dw_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_12_dw_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_12_dw_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_12_dw_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_12_dw_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[164, 0, 0], [165, 0, 0], [166, 0, 0], [167, 0, 1], [168, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_12_dw_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[169, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_12_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_12_conv2d", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[170, 0, 0], [171, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_12_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_12_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_12_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_12_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_12_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[172, 0, 0], [173, 0, 0], [174, 0, 0], [175, 0, 1], [176, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_12_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[177, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_13_dw_conv2d_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_13_dw_conv2d", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[178, 0, 0], [179, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_13_dw_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_13_dw_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_13_dw_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_13_dw_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_13_dw_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[180, 0, 0], [181, 0, 0], [182, 0, 0], [183, 0, 1], [184, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_13_dw_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[185, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_13_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_13_conv2d", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[186, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_13_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_13_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_13_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_13_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_13_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[188, 0, 0], [189, 0, 0], [190, 0, 0], [191, 0, 1], [192, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_13_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[193, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_14_dw_conv2d_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_14_dw_conv2d", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[194, 0, 0], [195, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_14_dw_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_14_dw_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_14_dw_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_14_dw_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_14_dw_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[196, 0, 0], [197, 0, 0], [198, 0, 0], [199, 0, 1], [200, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_14_dw_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[201, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_14_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_14_conv2d", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[202, 0, 0], [203, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_14_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_14_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_14_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_14_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_14_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[204, 0, 0], [205, 0, 0], [206, 0, 0], [207, 0, 1], [208, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_14_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[209, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_final_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_final_conv2d", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[210, 0, 0], [211, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_final_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_final_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_final_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_final_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_final_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[212, 0, 0], [213, 0, 0], [214, 0, 0], [215, 0, 1], [216, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_final_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[217, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rf_c3_lateral_weight", 
      "attrs": {
        "__init__": "[\"normal\", {\"sigma\": 0.01}]", 
        "__lr_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_c3_lateral_bias", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__lr_mult__": "2.0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "rf_c3_lateral", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[218, 0, 0], [219, 0, 0], [220, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rf_c3_lateral_bn_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_c3_lateral_bn_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_c3_lateral_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_c3_lateral_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "rf_c3_lateral_bn", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[221, 0, 0], [222, 0, 0], [223, 0, 0], [224, 0, 1], [225, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "rf_c3_lateral_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[226, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride32_conv1_weight", 
      "attrs": {
        "__init__": "[\"normal\", {\"sigma\": 0.01}]", 
        "__lr_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride32_conv1_bias", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__lr_mult__": "2.0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "rf_head_stride32_conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[227, 0, 0], [228, 0, 0], [229, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride32_conv1_bn_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride32_conv1_bn_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride32_conv1_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride32_conv1_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "rf_head_stride32_conv1_bn", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[230, 0, 0], [231, 0, 0], [232, 0, 0], [233, 0, 1], [234, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride32_context_conv1_weight", 
      "attrs": {
        "__init__": "[\"normal\", {\"sigma\": 0.01}]", 
        "__lr_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride32_context_conv1_bias", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__lr_mult__": "2.0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "rf_head_stride32_context_conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[227, 0, 0], [236, 0, 0], [237, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride32_context_conv1_bn_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride32_context_conv1_bn_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride32_context_conv1_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride32_context_conv1_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "rf_head_stride32_context_conv1_bn", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[238, 0, 0], [239, 0, 0], [240, 0, 0], [241, 0, 1], [242, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "rf_head_stride32_context_conv1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[243, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride32_context_conv2_weight", 
      "attrs": {
        "__init__": "[\"normal\", {\"sigma\": 0.01}]", 
        "__lr_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
